package com.sansen.myandroidlifegamedame.activity;

import androidx.appcompat.app.AppCompatActivity;

/**
 * 关于，关于什么，现在还没想好，刚才的想法，就是每次都随便写一些乱七八糟的。甚至可以专门给这个功能开发一个聊天功能。
 * 是的，类似于论坛的那种聊天，不过应该会更简单一点。
 * 想法：我可以写一个占用行列比较少，比较清晰的界面，加上点击事件，让玩家手绘模块，或者也可以用坐标绘制模块。
 * 2、要不要共享模块的功能？玩家可以选择将自己设计好的模块上传到网上（避免服务器的压力，需要先进行判重）。其他玩家可以根据需要选择下载到自己的模块库。
 * 3、要不要有模块库的功能？对于2想法的一种整合，将他们辛辛苦苦写好的东西，整合到模块库里。模块要分基础模块，就是不需要和别的模块互动的单个的整体。还有整合模块，就是多个基础模块整合成的一个大整体。
 * 3.1调整模块的位置。
 * 4、后期还要有放大缩小功能。
 * 5、目前只有滑翔机一个初始模块，然后支持自定义模块。TODO 自定义模块。
 */
public class AboutActivity extends AppCompatActivity {
}
